local process = Process("font")

function process:onStart()
    
    time.setInterval(1, function()
        UITooltips(1)
              :absolut(UI_ALIGN_TOP, 0, -0.1)
              :content(
            {
                padding = { 0, 0, 0, 0 },
                tips = {
                    "00000000000000000000000000000000000000000000",
                    "41343151435415145141343151435415145141151451",
                    "00000000000000000000000000000000000000000000",
                    "43154134515134513413508590427590247090000000",
                    "00000000000046625652625652452525200000000000",
                    "00000333333333300000000000000000000000000000",
                }
            }):show(true)
        UITooltips(2)
              :relation(UI_ALIGN_TOP, UITooltips(1), UI_ALIGN_BOTTOM, 0, -0.01)
              :content(
            {
                padding = { 0, 0, 0, 0 },
                tips = {
                    "图家艾斯欧迪决赛打击欧式的决赛哦等你哦撒谎降低菩萨多久哦",
                    "苏打水斯欧迪决赛打击欧式的决赛哦等你哦撒谎降低菩萨多久哦",
                    "赛哦等你哦撒谎降低菩萨多久哦大家艾斯欧迪决赛打击欧式的决",
                    "大家艾斯欧迪决赛打击欧式的决赛哦等你哦撒谎降低菩萨多久具",
                    "哒哒低撒娇地哦你大家艾斯欧殴菩萨多久哦哒撒谎降低一二三降",
                    "我哪次额盾吃你你你的超级爱点会死啊的洁癖大盘晚上见哦破道",
                }
            }):show(true)
        UITooltips(3)
              :relation(UI_ALIGN_TOP, UITooltips(2), UI_ALIGN_BOTTOM, 0, -0.01)
              :content(
            {
                padding = { 0, 0, 0, 0 },
                tips = {
                    "）*（…………@￥%￥@……&*……）（*）*）@￥@￥…………￥*U……*（",
                    "#！@￥#%￥@%？｛“P？｛”》P:O$#!$@#$!#$!3#@！#@！#@",
                    "）*（…………@￥%￥@……&*……）（*）*）@￥@￥…………￥*U……*（",
                    "~!@!~#$@!$@&Y^(*&)&+_)+{}_}{P}{P|}{P:PO:PO}|\\]",
                    "%%%%%%%%%%%%%%%%%%%%%d31h89d1h89f1h893d1h83dh18",
                    "jd93ej9dj3109-f13k0-fjeiogvhiogh1ifhisahidhaiddh",
                }
            }):show(true)
    end)

end